<?php
function title()
{
    return 'ระบบประเมินความพึงพอใจต่อคุณภาพการบริการสิ่งสนับสนุนการเรียนรู้ กรณีศึกษาหลักสูตรวิทยาศาสตรบัณฑิต สาขาเทคโนโลยีสารสนเทศ';
}
function date_thai($date)
{
    $__thai_month = [
        "01" => 'มกราคม',
        "02" => 'กุมภาพันธ์',
        "03" => 'มีนาคม',
        "04" => 'เมษายน',
        "05" => 'พฤษภาคม',
        "06" => 'มิถุนายน',
        "07" => 'กรกฏาคม',
        "08" => 'สิงหาคม',
        "09" => 'กันยายน',
        "10" => 'ตุลาคม',
        "11" => 'พฤศจิกายน',
        "12" => 'ธันวาคม',
    ];

    $exp = explode("-", $date);
    list($year, $month, $day) = $exp;
    $year = $year + 543;
    return "{$day} {$__thai_month[$month]} {$year}";
}

function created_at($date)
{
    $__thai_month = [
        "01" => 'มกราคม',
        "02" => 'กุมภาพันธ์',
        "03" => 'มีนาคม',
        "04" => 'เมษายน',
        "05" => 'พฤษภาคม',
        "06" => 'มิถุนายน',
        "07" => 'กรกฏาคม',
        "08" => 'สิงหาคม',
        "09" => 'กันยายน',
        "10" => 'ตุลาคม',
        "11" => 'พฤศจิกายน',
        "12" => 'ธันวาคม',
    ];

    if ($date == null) {
        return '';
    }
    $a = explode(" ", $date);
    list($date, $time) = $a;

    $exp = explode("-", $date);
    list($year, $month, $day) = $exp;
    $year = $year + 543;
    return "{$day} {$__thai_month[$month]} {$year} เวลา:{$time}";
}